//
//  main.swift
//  test
//
//  Created by Максим Минаков on 23.07.2025.
//

import Foundation
//
//print("Hello, World!")


// comment


// -------------------------------------- Имена и значения -----------------------------

//var lada = 10
//var ladA = "Priora"
//
//print(lada, ladA)
//
//lada = 20
//print(lada, ladA)
//
//
//let e:Double = 3.14
//print(e)
//
//
//let y:Character = "A"
//print(y)

// ---------------------------------------- Ввод информации -------------------------------------------------------

//print("Введите ваше имя:")
//var a = readLine()
//print(a!)


// ---------------------------------------- Задачи -----------------------------------------------------------------

// задача_1

//print("Введите ваше имя:")
//let name = readLine()
//print("Привет,\(name!)!")


// задача_2

//print("Введите ваше имя и фамилию:")
//let name = readLine()
//let surname = readLine()
//print("Привет,\(name!) \(surname!)!")

// задача_3

//print("Выведите стихи, как пологается построчно:")
//print("Ели мясо мужики,\nпивом запивали\nО чём конюх говорил,\nони не понимали ! ")


print("""
    Ели мясо мужики, пивом запивали!
    О чём конюх говорил, они не понимали!
""")
